<template>
	<div>
		<h1>Minecraft サーバー利用に関する規約</h1>
		<h2>免責事項</h2>
		参加される前に、このページのルールを全てお読みください<br>

		また、参加される方は、このルールに全て同意されたこととみなします<br>

		また、本規約は予告なしに改変されることがあります<br>

		<h2>第一条 はじめに</h2>
		<h3>1項 ルールの適用条件</h3>
		サーバーにログインした者は以下のルールを全て読み、之に同意したと見做します<br>
		また、本規約はサーバー管理者(以下管理者とします)を除く全て者に適用することとする<br>
		また、第二条2項の禁止行為に関してはサーバーのログインの有無を問わない<br>

		<h3>2項 参加資格</h3>
		<ul>
			<li>正規の方法にて入手したMinecraftアカウントが必要(クラッキング※所謂割れ・公式以外からの購入※所謂Altアカウント等アカウントの参加は固く禁じます)</li>
			<li>MCBANSのレベルが8以下の者は接続を拒否されます</li>
			<li>当系列サーバーにBANされている者は接続を拒否されます</li>
			<li>日本語を通じて支障なく会話ができる者※翻訳ソフトやサイトを使っての意思疎通も可とすることにする</li>
			<li>ある程度の常識があり問題なく受け答えのできる者</li>
		</ul>

		<h3>3項 仕様等</h3>
		<ul>
			<li>当サーバーは基本無料で遊ぶことが出来ます(寄付・課金等は除く)</li>
			<li>詳細な仕様等は以下のサイトでご覧ください</li>
		</ul>
		
		公式サイト：<a href="//freeserver.pro/" target="_blank">http://freeserver.pro/</a><br>
		JMS：<a href="https://minecraft.jp/servers/play.freeserver.pro" target="_blank">https://minecraft.jp/servers/play.freeserver.pro</a><br>
		monocraft：<a href="https://monocraft.net/servers/cb23696EAKqv51cX1L6U" target="_blank">https://monocraft.net/servers/cb23696EAKqv51cX1L6U</a><br>

		<h2>第二条 マナー・利用に際するルール</h2>
		<h3>1項 チャット・マナー</h3>
		<ul>
			<li>全てのプレイヤーが快適に遊べるよう努めてください</li>
			<li>スパムチャット・スパム・又、無許可の宣伝はおやめください</li>
			<li>他プレイヤー・管理者にアイテム・権限又その他の要求を強要しないでください</li>
			<li>Minecraftのユーザーはご自身で管理してください</li>
			<li>公序良俗に反さないでください</li>
		</ul>

		<h3>2項 禁止行為</h3>
		<p>サーバーへの参加の有無にかかわらず以下の行為を固く禁じます</p>
		<ul>
			<li>2時間以上連続で同座標から動かない行為</li>
			<li>当鯖におけるサーバーリソースパックを二次配布又は、改変等をする行為</li>
			<li>他プレイヤーの快適なプレイを妨げる行為（一方的な攻撃を故意的に仕掛ける等）</li>
			<li>サーバーの運営を妨げる行為・サーバーへの攻撃等の行為・管理者の指示に従わない行為</li>
			<li>個人運営・団体運営限らず他サーバーへの勧誘行為、またFREESERVERとは全く関係のない宣伝行為</li>
			<li>第一条2項の資格を満たしていないにもかかわらずそれを偽って参加する行為</li>
			<li>他プレイヤーのアイテムや経験値その他を故意に窃盗したり、紛失させる行為</li>
			<li>第二条1項の規約に反する行為</li>
			<li>チート・ハッククライアント・不正ツール・許可されていないMOD・不具合等を使用してプレイする行為</li>
			<li>犯罪行為・それに関連する行為</li>
			<li>鯖主・運営・プレイヤー・第三者の知的財産権、肖像権、プライバシー、名誉その他権利また利益を侵害、毀損する行為。</li>
			<li>他人からアイテム・通貨・その他所有物を騙し取る行為</li>
			<li>法令・公序良俗に反する行為</li>
			<li>FREESERVERRAILWAYS(以下FRと呼ぶ)の路線内を徒歩で移動する行為</li>
			<li>サーバーに対して負荷のかかる回路を30分以上停止機構なしで運用すること</li>
			<li>過度に暴力的な表現，露骨な性的表現，人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現，自殺，自傷行為，薬物乱用を誘引または助長する表現，その他反社会的な内容を含み他人に不快感を与える表現を，投稿または送信する行為</li>
			<li>当サーバーを営利目的で利用する行為</li>
			<li>その他管理者がふさわしくないと判断する可能性のある行為</li>
		</ul>

		<h3>3項 建築・区画整備及び負荷低減に関する規約</h3>
		<ul>
			<li>無意味にブロックを設置する行為は禁止とします</li>
			<li>保護された土地を隣接する行為は禁止とします(2ブロック以上開けること)</li>
			<li>隣り合った土地の保護は禁止とします</li>
		</ul>

		また、隣接した土地に建造物を追加する際は最低で２ブロックの隙間を空けねばなりません<br>

		保護されていない状態で1か月以上ログインがない場合建造物は撤去されます<br>

		又、上記の場合チェスト内のアイテム等は保存されません<br>

		トラップタワー等の意図的にMOBを発生させる装置等の建築を禁止します<br>

		※サーバー運営側から特別に許可されたものを除きます<br>

		ホッパーを多量に使う建築・クロック回路等のサーバーに負荷のかかる建築作成する場合は管理者に相談してください<br>

		又、クロック回路を使う場合は停止することのできる機構を作り30分以上連続で稼働させないように<br>

		建築ワールドでの資源回収は禁止です(建築に付随する整地作業は許可します)<br>

		1つの区画で保護できる最大領域は4チャンクとなります<br>

		保護されている領域で長時間ログインが確認されない場合は別区画に移動することがあります<br>

		MOBを飼育する場合1チャンクに20±5匹までとする、又、個人で保有できるMOBの総数は50匹迄とする<br>

		<h2>第四条 処罰</h2>
		<h3>1項 処罰の定義</h3>
		<ul>
			<li>強制退出とは、管理者等により予告なく一時的に退出させられること</li>
			<li>期限付きでの接続拒否とは、一時的な接続禁止になる処罰のこと</li>
			<li>長期間の接続拒否とは、1ヶ月以上の接続禁止になる処罰のこと</li>
			<li>永久の接続拒否とは、二度とFREESERVER及び系列サーバー(Discord含む)に接続できなくなる処罰のこと</li>
			<li>法的機関とは警察や弁護士などのこと</li>
		</ul>

		<h3>2項 処罰の種類</h3>
		<ul>
			<li>以上のルールを遵守しない者や迷惑行為を行った場合、事前通知なく、その者に処罰を与えることができます。</li>
			<li>処罰の内容に関しては以下の通りです</li>
			<ol>
				<li>サーバーからの強制退出</li>
				<li>期限付きでの接続拒否</li>
				<li>長期間の接続拒否・又はユーザーデータの削除</li>
				<li>永久の接続拒否</li>
				<li>法的機関への訴訟もしくは通報</li>
			</ol>
		</ul>

		過去に法的機関への通報を行い逮捕者が出ています<br>
		ご理解の上ご利用ください<br>
		また、処罰情報はデータベースにて公開されユーザーは自由に閲覧できます<br>
		<h2>第五条 その他</h2>
		<h3>1項 その他</h3>
		<ul>
			<li>ユーザーに通知することなく，本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，これによってユーザーに生じた損害について一切の責任を負いません。</li>
			<li>本規約の解釈に関しては、日本国法を準拠法とします</li>
		</ul>

		以上をFRESERVERPROJECTMinecraftサーバー参加時の規約とする<br>

		最終更新令和四年 一月二十六日<br>

		発効同日
	</div>
</template>
<script>
export default {
	name: 'TOS'
}
</script>
